BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega256RFR2.PIC
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="SCTSRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRHH" edc:desc="Symbol Counter Frame Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="SCOCR3LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LL" edc:desc="Symbol Counter Output Compare Register 3 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="SCOCR3LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LH" edc:desc="Symbol Counter Output Compare Register 3 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="SCOCR3HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HL" edc:desc="Symbol Counter Output Compare Register 3 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="SCOCR3HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HH" edc:desc="Symbol Counter Output Compare Register 3 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="SCOCR2LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LL" edc:desc="Symbol Counter Output Compare Register 2 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="SCOCR2LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LH" edc:desc="Symbol Counter Output Compare Register 2 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="nnnnnnnn" edc:cname="SCOCR2HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HL" edc:desc="Symbol Counter Output Compare Register 2 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="SCOCR2HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HH" edc:desc="Symbol Counter Output Compare Register 2 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF5" edc:access="nnnnnnnn" edc:cname="SCOCR1LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LL" edc:desc="Symbol Counter Output Compare Register 1 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="SCOCR1LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LH" edc:desc="Symbol Counter Output Compare Register 1 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="SCOCR1HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1HL" edc:desc="Symbol Counter Output Compare Register 1 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnn" edc:cname="SCOCR1HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1HH" edc:desc="Symbol Counter Output Compare Register 1 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF9" edc:access="nnnnnnnn" edc:cname="SCTSTRLL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSTRLL" edc:desc="Symbol Counter Transmit Frame Timestamp Register LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFA" edc:access="nnnnnnnn" edc:cname="SCTSTRLH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSTRLH" edc:desc="Symbol Counter Transmit Frame Timestamp Register LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
